<?php 
header("Content-type: text/x-csv");
header("Content-Disposition: attachment; filename=output.csv");
// $content = "Column1,Column2,Column3\nRow1,中文測試";

$content = "0800000001,扶手轉椅,,1,小敏,小敏,L0718,,0000-00-00,2300,0,0,0,
			      0800000002,扶手轉椅,,1,小敏,小敏,L0718,,0000-00-00,2300,0,0,0,
			      0800000003,扶手轉椅,,1,小敏,小敏,L0718,,0000-00-00,2300,0,0,0,
			      0800000004,磁性白板,,1,小敏,小敏,L0718,,0000-00-00,2300,0,0,0,
			      0800000005,珠光銀幕,,1,小敏,小敏,L0718,,0000-00-00,2300,0,0,0,
			      0800000006,珠光銀幕,,1,小敏,小敏,L0718,,0000-00-00,2300,0,0,0,
			      D000000001,桌上型數位電錶,,1,小敏,小敏,L0740,教育部獎補助,0000-00-00,7000,0,0,0,
			      D000000002,桌上型數位電錶,,1,小敏,小敏,L0740,教育部獎補助,0000-00-00,7000,0,0,0,
			      D000000003,桌上型數位電錶,,1,小敏,小敏,L0740,教育部獎補助,0000-00-00,7000,0,0,0,";


$content = mb_convert_encoding($content , "Big5" , "UTF-8");
echo $content;
exit;
?>